app/controllers/deceased_posts_controller.rb

SELECT "deceased_posts".* FROM "deceased_posts" WHERE "deceased_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_deceased_post
      @deceased_post = DeceasedPost.find(params[:id])